# Pemilihan kolom (columns selection)

# Import Modules

In [1]:
import pandas as pd
import numpy as np

# Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 2
columns = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=columns)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows,freq='H')
df = df.reset_index()
df['teks'] = list('ABCDE')

df

C:\Users\ibnua\anaconda3\lib\site-packages\pandas\util\__init__.py:16: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          6.0         12    A
1 2000-01-01 01:00:00         12.0          6    B
2 2000-01-01 02:00:00          1.0         18    C
3 2000-01-01 03:00:00          2.0         19    D
4 2000-01-01 04:00:00         16.0          9    E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [6]:
df = df.rename(columns={'index':'jam'})
df

                  jam  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          6.0         12    A
1 2000-01-01 01:00:00         12.0          6    B
2 2000-01-01 02:00:00          1.0         18    C
3 2000-01-01 03:00:00          2.0         19    D
4 2000-01-01 04:00:00         16.0          9    E

In [8]:
df.dtypes

jam            datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

# Memilih Kolom Bertipe Data Numerik

In [9]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          6.0         12
1         12.0          6
2          1.0         18
3          2.0         19
4         16.0          9

In [10]:
df.select_dtypes(include='int')

   bil_bulat
0         12
1          6
2         18
3         19
4          9

In [11]:
df.select_dtypes('float')

   bil_pecahan
0          6.0
1         12.0
2          1.0
3          2.0
4         16.0

# Memilih Kolom Bertipe Data String Or Object

In [12]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

# Memilih Kolom Dengan Kombinasi Tipe Data

In [13]:
df.select_dtypes(include=['object','datetime'])

                  jam teks
0 2000-01-01 00:00:00    A
1 2000-01-01 01:00:00    B
2 2000-01-01 02:00:00    C
3 2000-01-01 03:00:00    D
4 2000-01-01 04:00:00    E